PX4/PX4-Autopilot/nuttx/arch/arm/src/stm32/stm32_otgfshost.c
  /* Loop, testing for an end of transfer conditino.  The channel 'result'
   * was set to EBUSY and 'waiter' was set to true before the transfer; 'waiter'
   * will be set to false and 'result' will be set appropriately when the
   * tranfer is completed.
   */

  do
    {
      /* Wait for the transfer to complete.  NOTE the transfer may already
       * completed before we get here or the transfer may complete while we
       * wait here.
       */

      ret = sem_wait(chan->waitsem);

      /* sem_wait should succeeed.  But it is possible that we could be
       * awakened by a signal too.
       */

      DEBUGASSERT(ret == OK || get_errno() == EINTR);
    }
  while (chan->waiter);

  /* The transfer is complete re-enable interrupts and return the result */

  ret = -(int)chan->result;
  irqrestore(flags);
  return ret;
}

/*******************************************************************************
 * Name: stm32_chan_wakeup
 *
 * Description:
 *   A channel transfer has completed... wakeup any threads waiting for the
 *   transfer to complete.
 *
 * Assumptions:
 *   This function is called from the transfer complete interrupt handler for
 *   the channel.  Interrupts are disabled.
 *
 *******************************************************************************/

static void stm32_chan_wakeup(FAR struct stm32_usbhost_s *priv,
                              FAR struct stm32_chan_s *chan)
{
  /* Is there a thread waiting for this transfer to complete? */

  if (priv->chan[chidx].result != EBUSY && chan->waiter)
    {
      stm32_givesem(&chan->waitsem);
      chan->waiter = false;
    }
}

/*******************************************************************************
 * Name: stm32_transfer_start
 *
 * Description:
 *   Start at transfer on the select IN or OUT channel.
 *
 *******************************************************************************/

static void stm32_transfer_start(FAR struct stm32_usbhost_s *priv, int chidx)
{
  uint32_t regval;
  unsigned int npackets;
  unsigned int maxpacket;
  unsigned int buflen32;
  unsigned int avail32;

  /* Set up the initial state of the transfer */

  priv->chan[chidx].result = EBUSY;
  priv->chan[chidx].xfrlen = 0;

  /* Compute the expected number of packets associated to the transfer.
   * If it is a IN endpoint, then we need to round down to the number
   * of full, maximally sized packets that can fit in the read buffer.
   */

  mxpacket = priv->chan[chidx].maxpacket;
  if (priv->chan[chidx].isin)
    {
      npackets = priv->chan[chidx].buflen / maxpacket;

      /* A read buffer must at least one max packet size in length */

      DEBUGASSERT(npackets > 0);

      /* For the buffer length to an even multiple of maxpacket */

      priv->chan[chidx].buflen = npackets * maxpacket;
    }

  /* If it is an OUT endpoint, then we need round up to include any
   * possible partial, final packet.
   */

  else if (priv->chan[chidx].buflen > 0)
    {
      npackets = (priv->chan[chidx].buflen + maxpacket - 1) / maxpacket;
    }

  /* Otherwise, we are sending a single zero-length packet */

  else
    {
      npackets = 1;
    }

  /* Clip it the buffer length if it exceeds the maximum number of
   * packets that can be transferred (this should not happen).
   */

  if (npackets > STM32_MAX_PKTCOUNT)
    {
      npackets = STM32_MAX_PKTCOUNT;
      priv->chan[chidx].buflen = STM32_MAX_PKTCOUNT * maxpacket;
    }

  /* Setup the HCTSIZn register */

  regval = ((uint32_t)priv->chan[chidx].buflen << OTGFS_HCTSIZ_XFRSIZ_SHIFT) |
           ((uint32_t)npackets << OTGFS_HCTSIZ_PKTCNT_SHIFT) |
           ((uint32_t)priv->chan[chidx].pid << OTGFS_HCTSIZ_DPID_SHIFT);
  stm32_putreg(STM32_OTGFS_HCTSIZ(chidx), regval);

  /* Setup the HCCHAR register: Frame oddness and host channel enable */

  regval = stm32_getreg(STM32_OTGFS_HCCHAR(chidx));

  /* Check for an even frame */

  if ((stm32_getreg(STM32_OTGFS_HFNUM) & 1) == 0)
    {
      regval |= OTGFS_HCCHAR_ODDFRM;
    }

  regval &= ~OTGFS_HCCHAR_CHDIS;
  regval |= OTGFS_HCCHAR_CHENA;
  stm32_putreg(STM32_OTGFS_HCCHAR(chidx), regval);

  /* If this is an out transfer, then we need to do more.. we need to copy the
   * outgoing data into the correct TxFIFO.
   */

  if (!priv->chan[chidx].isin && priv->chan[chidx].buflen > 0)
    {
      /* Handle non-periodic (CTRL and BULK) OUT transfers differently than
       * perioci (INTR and ISOC) OUT transfers.
       */

      buflen32 = (priv->chan[chidx].buflen + 3) >> 2;
      switch (priv->chan[chidx].eptype)
        {
        case OTGFS_EPTYPE_CTRL: /* Non periodic transfer */
        case OTGFS_EPTYPE_BULK:
          {
            /* Read the Non-periodic Tx FIFO status register */

            regval  = stm32_getreg(STM32_OTGFS_HNPTXSTS);
            avail32 = (regval & OTGFS_HNPTXSTS_NPTXFSAV_MASK) >> OTGFS_HNPTXSTS_NPTXFSAV_SHIFT;

            /* Check if there is enough space in the Tx FIFO space */

            if (buflen32 > avail32)
              {
                /* Insufficient space... Enable the Non-periodic Tx FIFO
                 * interrupt to handle the transfer when the Tx FIFO is empty.
                 */

                stm32_modifyreg(STM32_OTGFS_GINTMSK, 0, OTGFS_GINT_NPTXFE);
            }
          }
          break;

          /* Periodic transfer */

          case OTGFS_EPTYPE_INTR:
          case OTGFS_EPTYPE_ISOC:
            /* Read the Non-periodic Tx FIFO status register */

            regval  = stm32_getreg(STM32_OTGFS_HPTXSTS);
            avail32 = (regval & OTGFS_HPTXSTS_PTXFSAVL_MASK) >> OTGFS_HPTXSTS_PTXFSAVL_SHIFT;

            /* Check if there is enough space in FIFO space */

            if (buflen32 > avail32)
              {
                /* Need to process data in OTGFS_GINT_PTXFE interrupt */

                stm32_modifyreg(STM32_OTGFS_GINTMSK, 0, OTGFS_GINT_PTXFE);
              }
            break;

          default:
            break;
          }

        /* Write packet into the Tx FIFO. */

        stm32_gint_wrpacket(priv, priv->chan[chidx].buffer, chidx, priv->chan[chidx].buflen);
    }
}


