PX4/PX4-Autopilot/nuttx/arch/arm/src/stm32/stm32_otgfshost.c
      txsts = stm32_getreg(STM32_OTGFS_HNPTXSTS);
      if ((txsts & OTGFS_HNPTXSTS_NPTXFSAV_MASK) == 0)
        {
          /* The Tx FIFO is empty... disable the channel */

          hcchar &= ~OTGFS_HCCHAR_CHENA;
        }
    }
  else /* if (eptype == OTGFS_HCCHAR_EPTYP_ISOC || eptype == OTGFS_HCCHAR_EPTYP_INTR) */
    {
      /* Check if the periodic Tx FIFO is empty. */

      txsts = stm32_getreg(STM32_OTGFS_HPTXSTS);
      if ((txsts & OTGFS_HPTXSTS_PTXFSAVL_MASK) == 0)
        {
          /* The Tx FIFO is empty... disable the channel */

          hcchar &= ~OTGFS_HCCHAR_CHENA;
        }
    }

  /* Halt the channel by setting CHDIS in the HCCHAR */

  stm32_putreg(STM32_OTGFS_HCCHAR(chidx), hcchar);
}

/*******************************************************************************
 * Name: stm32_gint_hcinisr
 *
 * Description:
 *   USB OTG FS host IN channels interrupt handler
 *
 *******************************************************************************/

static inline void stm32_gint_hcinisr(FAR struct stm32_usbhost_s *priv,
                                      int chidx)
{
  FAR struct stm32_chan_s *chan = &priv->chan[chidx];
  uint32_t hcint;
  uint32_t hcintmsk;
  uint32_t hcchar;
  uint32_t hctsiz;
  unsigned int eptype;

  /* Read the HCINT register to get the pending HC interrupts.  Read the
   * HCINTMSK register to get the set of enabled HC interrupts.
   */

  hcint    = stm32_getreg(STM32_OTGFS_HCINT(chidx));
  hcintmsk = stm32_getreg(STM32_OTGFS_HCINTMSK(chidx));

  /* AND the two to get the set of enabled, pending HC interrupts */

  pending = hcint & hcintmsk;

  /* Pre-fetch the HCCHAR register and extract the endpoint type.  Those
   * values are used in several cases.
   */

  hcchar = stm32_getreg(STM32_OTGFS_HCCHAR(chidx));
  eptype = (hcchar & OTGFS_HCCHAR_EPTYP_MASK) >> OTGFS_HCCHAR_EPTYP_SHIFT;

  /* Check for a pending ACK response received/transmitted (ACK) interrrupt */

  if ((pending & OTGFS_HCINT_ACK) != 0)
    {
      /* Clear the pending the ACK response received/transmitted (ACK) interrupt */

      hcint &= ~OTGFS_HCINT_ACK;
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);
    }

  /* Check for a pending STALL response receive (STALL) interrrupt */

  else if ((pending & OTGFS_HCINT_STALL) != 0)
    {
      /* Unmask the CHannel Halted (CHH) interrupt */

      hcintmsk |= OTGFS_HCINT_CHH;
      stm32_putreg(STM32_OTGFS_HCINTMSK(chidx), hcintmsk);

      /* Set the stall state */

      chan->chstate = CHSTATE_STALL;

      /* Clear the NAK and STALL Conditions. */

      hcint &= ~(OTGFS_HCINT_NAK | OTGFS_HCINT_STALL);
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);

      /* Halt the Tx channel */

      stm32_gint_halttxchan(priv, chidx);

      /* When there is a STALL, clear any pending NAK so that it is nor
       * processed below.
       */

      pending &= ~OTGFS_HCINT_NAK;
    }

  /* Check for a pending Data Toggle ERRor (DTERR) interrrupt */

  else if ((pending & OTGFS_HCINT_DTERR) != 0)
    {
      /* Unmask the CHannel Halted (CHH) interrupt */

      hcintmsk |= OTGFS_HCINT_CHH;
      stm32_putreg(STM32_OTGFS_HCINTMSK(chidx), hcintmsk);

      /* Halt the Tx channel */

      stm32_gint_halttxchan(priv, chidx);

      /* Clear the NAK and data toggle error conditions */

      hcint &= ~(OTGFS_HCINT_NAK | OTGFS_HCINT_DTERR);
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);

      /* Set the Data Toggle ERRor (DTERR) state */

      chan->chstate = CHSTATE_DTERR;
    }

  /* Check for a pending FRaMe OverRun (FRMOR) interrrupt */

  if ((pending & OTGFS_HCINT_FRMOR) != 0)
    {
      /* Unmask the CHannel Halted (CHH) interrupt */

      hcintmsk |= OTGFS_HCINT_CHH;
      stm32_putreg(STM32_OTGFS_HCINTMSK(chidx), hcintmsk);

      /* Halt the Tx channel */

      stm32_gint_halttxchan(priv, chidx);

      /* Clear the FRaMe OverRun (FRMOR) condition */

      hcint &= ~OTGFS_HCINT_FRMOR;
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);
    }

  /* Check for a pending TransFeR Completed (XFRC) interrrupt */

  else if ((pending & OTGFS_HCINT_XFRC) != 0)
    {
      /* Set the trnansfer complete state and reset the error count */

      chan->chstate = CHSTATE_XFRC;
      chan->nerrors = 0;

      /* Clear the TransFeR Completed (XFRC) condition */

      hcint &= ~OTGFS_HCINT_XFRC;
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);

      if ((eptype == OTGFS_HCCHAR_EPTYP_CTRL) ||
          (eptype == OTGFS_HCCHAR_EPTYP_BULK))
        {
          /* Unmask the CHannel Halted (CHH) interrupt */

          hcintmsk |= OTGFS_HCINT_CHH;
          stm32_putreg(STM32_OTGFS_HCINTMSK(chidx), hcintmsk);

          /* Halt the Tx channel */

          stm32_gint_halttxchan(priv, chidx);

          /* Clear any pending NAK condition */

          hcint &= ~OTGFS_HCINT_NAK;
          stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);

          /* Toggle the IN data state */

          chan->indata1 ^= true;
        }
      else if (eptype == OTGFS_HCCHAR_EPTYP_INTR)
        {
          /* Force the next transfer on an ODD frame */

          hcchar |= OTGFS_HCCHAR_ODDFRM;
          stm32_putreg(STM32_OTGFS_HCCHAR(chidx), hcchar);

          /* Set the request done state */

          chan->result = OK;
        }
    }

  /* Check for a pending CHannel Halted (CHH) interrrupt */

  else if ((pending & OTGFS_HCINT_CHH) != 0)
    {
      /* Mask the CHannel Halted (CHH) interrupt */

      hcintmsk &= ~OTGFS_HCINT_CHH;
      stm32_putreg(STM32_OTGFS_HCINTMSK(chidx), hcintmsk);

      /* Update the request state based on the host state machine state */

      if (chan->chstate == CHSTATE_XFRC)
        {
          /* Set the request done state */

          chan->result = OK;
        }
      else if (chan->chstate == CHSTATE_STALL)
        {
          /* Set the request stall state */

          chan->result = EPERM;
        }
      else if ((chan->chstate == CHSTATE_TXERR) ||
               (chan->chstate == CHSTATE_DTERR))
        {
          /* Set the request error state */

