PX4/PX4-Autopilot/nuttx/arch/arm/src/stm32/stm32_otgfshost.c
          chan->nerrors = 0;
          chan->result = EIO;

        }
      else if (eptype == OTGFS_HCCHAR_EPTYP_INTR)
        {
          /* Toggle the IN data toggle */

          chan->indata1 ^= true;
        }

      /* Clear the CHannel Halted (CHH) condition */

      hcint &= ~OTGFS_HCINT_CHH;
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);
    }

  /* Check for a pending Transaction ERror (TXERR) interrrupt */

  else if ((pending & OTGFS_HCINT_TXERR) != 0)
    {
      /* Unmask the CHannel Halted (CHH) interrupt */

      hcintmsk |= OTGFS_HCINT_CHH;
      stm32_putreg(STM32_OTGFS_HCINTMSK(chidx), hcintmsk);

      /* Increment the error count and set the transaction error state */

      chan->nerrors++;
      chan->chstate = CHSTATE_TXERR;

      /* Halt the Tx channel */

      stm32_gint_halttxchan(priv, chidx);

      /* Clear the Transaction ERror (TXERR) condition */

      hcint &= ~OTGFS_HCINT_TXERR;
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);
    }

  /* Check for a pending NAK response received (NAK) interrrupt */

  else if ((pending & OTGFS_HCINT_NAK) != 0)
    {
      /* Handle the NAK based on the endpoint type */

      if (eptype == OTGFS_HCCHAR_EPTYP_INTR)
        {
          /* Unmask the CHannel Halted (CHH) interrupt */

          hcintmsk |= OTGFS_HCINT_CHH;
          stm32_putreg(STM32_OTGFS_HCINTMSK(chidx), hcintmsk);

          /* Halt the Tx channel */

          stm32_gint_halttxchan(priv, chidx);
        }
      else if ((eptype == OTGFS_HCCHAR_EPTYP_CTRL) ||
               (eptype == OTGFS_HCCHAR_EPTYP_BULK))
        {
          /* Re-activate the channel by clearing CHDIS and assuring that
           * CHENA is set
           */

          hcchar |= OTGFS_HCCHAR_CHENA;
          hcchar &= ~OTGFS_HCCHAR_CHDIS;
          stm32_putreg(STM32_OTGFS_HCCHAR(chidx), hcchar);
        }

      /* Set the NAK state */

      chan->chstate = CHSTATE_NAK;

      /* Clear the NAK condition */

      hcint &= ~OTGFS_HCINT_NAK;
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);
    }

  /* Check for a transfer complete event */

  stm32_chan_wakeup(priv, chan);
}

/*******************************************************************************
 * Name: stm32_gint_hcoutisr
 *
 * Description:
 *   USB OTG FS host OUT channels interrupt handler
 *
 *******************************************************************************/

static inline void stm32_gint_hcoutisr(FAR struct stm32_usbhost_s *priv,
                                       int chidx)
{
  FAR struct stm32_chan_s *chan = &priv->chan[chidx];
  uint32_t hcint;
  uint32_t hcintmsk;
  uint32_t pending;
  uint32_t hcchar;

  /* Read the HCINT register to get the pending HC interrupts.  Read the
   * HCINTMSK register to get the set of enabled HC interrupts.
   */

  hcint    = stm32_getreg(STM32_OTGFS_HCINT(chidx));
  hcintmsk = stm32_getreg(STM32_OTGFS_HCINTMSK(chidx));

  /* AND the two to get the set of enabled, pending HC interrupts */

  pending = hcint & hcintmsk;

  /* Check for a pending ACK response received/transmitted (ACK) interrrupt */

  if ((pending & OTGFS_HCINT_ACK) != 0)
    {
      /* Clear the pending the ACK response received/transmitted (ACK) interrupt */

      hcint &= ~OTGFS_HCINT_ACK;
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);
    }

  /* Check for a pending FRaMe OverRun (FRMOR) interrrupt */

  else if ((pending & OTGFS_HCINT_FRMOR) != 0)
    {
      /* Unmask the CHannel Halted (CHH) interrupt */

      hcintmsk |= OTGFS_HCINT_CHH;
      stm32_putreg(STM32_OTGFS_HCINTMSK(chidx), hcintmsk);

      /* Halt the Tx channel */

      stm32_gint_halttxchan(priv, chidx);

      /* Clear the pending the FRaMe OverRun (FRMOR) interrupt */

      hcint &= ~OTGFS_HCINT_FRMOR;
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);
    }

  /* Check for a pending TransFeR Completed (XFRC) interrrupt */

  else if ((pending & OTGFS_HCINT_XFRC) != 0)
    {
      chan->nerrors = 0;

      /* Unmask the CHannel Halted (CHH) interrupt */

      hcintmsk |= OTGFS_HCINT_CHH;
      stm32_putreg(STM32_OTGFS_HCINTMSK(chidx), hcintmsk);

      /* Halt the Tx channel */

      stm32_gint_halttxchan(priv, chidx);

      /* Clear the pending the TransFeR Completed (XFRC) interrupt */

      hcint &= ~OTGFS_HCINT_XFRC;
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);

      /* Set the transfer completed state */

      chan->chstate = CHSTATE_XFRC;
    }

  /* Check for a pending STALL response receive (STALL) interrrupt */

  else if ((pending & OTGFS_HCINT_STALL) != 0)
    {
      /* Clear the pending the STALL response receiv (STALL) interrupt */

      hcint &= ~OTGFS_HCINT_STALL;
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);

      /* Unmask the CHannel Halted (CHH) interrupt */

      hcintmsk |= OTGFS_HCINT_CHH;
      stm32_putreg(STM32_OTGFS_HCINTMSK(chidx), hcintmsk);

      /* Halt the Tx channel */

      stm32_gint_halttxchan(priv, chidx);

      /* Set the stall state */

      chan->chstate = CHSTATE_STALL;
    }

  /* Check for a pending NAK response received (NAK) interrrupt */

  else if ((pending & OTGFS_HCINT_NAK) != 0)
    {
      uint32_t regval;

      /* Clear the error count */

      chan->nerrors = 0;

      /* Unmask the CHannel Halted (CHH) interrupt */

      hcintmsk |= OTGFS_HCINT_CHH;
      stm32_putreg(STM32_OTGFS_HCINTMSK(chidx), hcintmsk);

      /* Halt the Tx channel */

      stm32_gint_halttxchan(priv, chidx);

      /* Clear the pending the NAK response received (NAK) interrupt */

      hcint &= ~OTGFS_HCINT_NAK;
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);

      /* Set the NAK state */

      chan->chstate = CHSTATE_NAK;
    }

  /* Check for a pending Transaction ERror (TXERR) interrrupt */

  else if ((pending & OTGFS_HCINT_TXERR) != 0)
    {
      /* Unmask the CHannel Halted (CHH) interrupt */

      hcintmsk |= OTGFS_HCINT_CHH;
      stm32_putreg(STM32_OTGFS_HCINTMSK(chidx), hcintmsk);

      /* Halt the Tx channel */

