PX4/PX4-Autopilot/nuttx/arch/arm/src/stm32/stm32_otgfshost.c
      stm32_gint_halttxchan(priv, chidx);

      /* Increment the number of errors */

      chan->nerrors++;

      /* Set the transaction error state */

      chan->chstate = CHSTATE_TXERR;

      /* Clear the pending the Transaction ERror (TXERR) interrupt */

      hcint &= ~OTGFS_HCINT_TXERR;
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);
    }

  /* Check for a pending response received (xxx) interrrupt */

#if 0 /* NYET is a reserved bit in the HCINT register */
  else if ((pending & OTGFS_HCINT_NYET) != 0)
    {
      chan->nerrors = 0;

      /* Unmask the CHannel Halted (CHH) interrupt */

      hcintmsk |= OTGFS_HCINT_CHH;
      stm32_putreg(STM32_OTGFS_HCINTMSK(chidx), hcintmsk);

      /* Halt the Tx channel */

      stm32_gint_halttxchan(priv, chidx);

      /* Clear the pending the response received (xxx) interrupt */

      hcint &= ~OTGFS_HCINT_NYET;
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);

      /* Set the NYET state */

      chan->chstate = CHSTATE_NYET;
    }
#endif

  /* Check for a pending Data Toggle ERRor (DTERR) interrrupt */

  else if (pending & OTGFS_HCINT_DTERR)
    {
      /* Unmask the CHannel Halted (CHH) interrupt */

      hcintmsk |= OTGFS_HCINT_CHH;
      stm32_putreg(STM32_OTGFS_HCINTMSK(chidx), hcintmsk);

      /* Halt the Tx channel */

      stm32_gint_halttxchan(priv, chidx);

      /* Set the data toggle error state */

      chan->chstate = CHSTATE_DTERR;

      /* Clear the pending the Data Toggle ERRor (DTERR) and NAK interrupts */

      hcint &= ~(OTGFS_HCINT_DTERR | OTGFS_HCINT_NAK);
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);
    }

  /* Check for a pending CHannel Halted (CHH) interrrupt */

  else if ((pending & OTGFS_HCINT_CHH) != 0)
    {
      /* Mask the CHannel Halted (CHH) interrupt */

      hcintmsk &= ~OTGFS_HCINT_CHH;
      stm32_putreg(STM32_OTGFS_HCINTMSK(chidx), hcintmsk);

      if (chan->chstate == CHSTATE_XFRC)
        {
          /* Set the request done state */

          chan->result = OK;

          /* Read the HCCHAR register to get the HCCHAR register to get
           * the endpoint type.
           */

          hcchar = stm32_getreg(STM32_OTGFS_HCCHAR(chidx));

          /* Is it a bulk endpoint */

          if ((hcchar & OTGFS_HCCHAR_EPTYP_MASK) == OTGFS_HCCHAR_EPTYP_BULK)
            {
              /* Yes... toggle the data out PID */

              chan->outdata1 ^= true;
            }
        }
      else if (chan->chstate == CHSTATE_NAK ||
               chan->chstate == CHSTATE_NYET)
        {
          chan->result = EGAIN;
        }
      else if (chan->chstate == CHSTATE_STALL)
        {
          /* Set the request stall state */

          chan->result = EPERM;
        }
      else if (chan->chstate == CHSTATE_TXERR)
        {
          /* Check the error count */

          if (chan->nerrors == 3)
            {
              /* If the error count exceeds a threshold, then set the request error state */

              chan->result  = EIO;
              chan->nerrors = 0;
            }
        }

      /* Clear the pending the CHannel Halted (CHH) interrupt */

      hcint &= ~OTGFS_HCINT_CHH;
      stm32_putreg(STM32_OTGFS_HCINT(chidx), hcint);
    }

  /* Check for a transfer complete event */

  stm32_chan_wakeup(priv, chan);
}

/*******************************************************************************
 * Name: stm32_gint_connected
 *
 * Description:
 *   Handle a connection event.
 *
 *******************************************************************************/

static void stm32_gint_connected(FAR struct stm32_usbhost_s *priv)
{
  /* We we previously disconnected? */

  if (!priv->connected)
    {
      /* Yes.. then now we are connected */
 
      ullvdbg("Connected\n");
      priv->connected = true;
      DEBUGASSERT(priv->smstate == SMTATE_IDLE);

      /* Notify any waiters */

      priv->smstate = SMSTATE_ATTACHED;
      if (priv->eventwait)
        {
          stm32_givesem(&priv->eventsem);
          priv->eventwait = false;
        }
    }
}

/*******************************************************************************
 * Name: stm32_gint_disconnected
 *
 * Description:
 *   Handle a disconnection event.
 *
 *******************************************************************************/

static void stm32_gint_disconnected(FAR struct stm32_usbhost_s *priv)
{
  /* Were we previously connected? */

  if !priv->connected)
    {
      /* Yes.. then we no longer connected */
 
      ullvdbg("Disconnected\n");
      priv->connected = false;

      /* Are we bound to a class driver? */

      if (priv->class)
        {
          /* Yes.. Disconnect the class driver */

          CLASS_DISCONNECTED(priv->class);
          priv->class = NULL;
        }

      /* Re-Initilaize Host for new Enumeration */

      stm32_swreset(priv);
      stm32_chan_freeall(priv);
      priv->smstate = SMSTATE_DETACHED;

    /* Notify any waiters that there is a change in the connection state */

     if (priv->eventwait)
        {
          stm32_givesem(&priv->eventsem);
          priv->eventwait = false;
        }
    }
}

/*******************************************************************************
 * Name: stm32_gint_sofisr
 *
 * Description:
 *   USB OTG FS start-of-frame interrupt handler
 *
 *******************************************************************************/

#ifdef CONFIG_STM32_OTGFS_SOFINTR
static inline void stm32_gint_sofisr(FAR struct stm32_usbhost_s *priv)
{
  /* Handle SOF interrupt */
#warning "Do what?"

  /* Clear pending SOF interrupt */

  stm32_putreg(STM32_OTGFS_GINTSTS, OTGFS_GINT_SOF);
}
#endif

/*******************************************************************************
 * Name: stm32_gint_rxflvlisr
 *
 * Description:
 *   USB OTG FS RxFIFO non-empty interrupt handler
 *
 *******************************************************************************/

static inline void stm32_gint_rxflvlisr(FAR struct stm32_usbhost_s *priv)
{
  FAR uint32_t *dest;
  uint32_t grxsts;
  uint32_t intmsk;
  uint32_t hcchar;
  uint32_t hctsiz;
  uint32_t fifo;
  int bcnt;
  int bcnt32;
  int chidx;
  int i;

  /* Disable the RxFIFO non-empty interrupt */

  intmsk  = stm32_getreg(STM32_OTGFS_GINTMSK)
  intmsk &= ~OTGFS_GINT_RXFLVL;
  stm32_putreg(STM32_OTGFS_GINTMSK, intmsk);

  /* Read and pop the next status from the Rx FIFO */

  grxsts = stm32_getreg(STM32_OTGFS_GRXSTSP);

  /* Isolate the channel number/index in the status word */

  chidx = (grxsts & OTGFS_GRXSTSH_CHNUM_MASK) >> OTGFS_GRXSTSH_CHNUM_SHIFT;

