PX4/PX4-Autopilot/nuttx/arch/arm/src/stm32/stm32_otgfshost.c
  /* Get the host channel characteristics register (HCCHAR) for this channel */

  hcchar = stm32_getreg(STM32_OTGFS_HCCHAR(chidx));

  /* The process the interrupt according to the packet status */

  switch (grxsts & OTGFS_GRXSTSH_PKTSTS_MASK)
    {
    case OTGFS_GRXSTSH_PKTSTS_INRECVD: /* IN data packet received */
      {
        /* Read the data into the host buffer. */

        int bcnt = (grxsts & OTGFS_GRXSTSH_BCNT_MASK) >> OTGFS_GRXSTSH_BCNT_SHIFT;

        if (bcnt > 0 && priv->chan[chidx].buffer != NULL)
          {
            /* Transfer the packet from the Rx FIFO into the user buffer */

            FAR uint32_t *dest = (FAR uint32_t *)priv->chan[chidx].buffer;
            uint32_t fifo = STM32_OTGFS_DFIFO_HCH(0);
            uint32_t hctsiz;
            int bcnt32 = (bcnt + 3) >> 2;

            for (i = 0; i < count32b; i++, dest += 4)
              {
                *dest++ = stm32_getreg(fifo);
              }

            /* Manage multiple packet transfers */

            priv->chan[chidx].buffer += bcnt;
            priv->chan[chidx].xfrlen += bcnt;
            priv->chan[chidx].xfrd    = priv->chan[chidx].xfrlen;

            /* Check if more packets are expected */

            hctsiz = stm32_getreg(STM32_OTGFS_HCTSIZ(chidx));
            if ((hctsiz & OTGFS_HCTSIZ_PKTCNT_MASK) != 0)
              {
                /* Re-activate the channel when more packets are expected */

                hcchar |= OTGFS_HCCHAR_CHENA;
                hcchar &= ~OTGFS_HCCHAR_CHDIS;
                stm32_putreg(STM32_OTGFS_HCCHAR(chidx), hcchar);
              }
          }
      }
      break;

    case OTGFS_GRXSTSH_PKTSTS_INDONE:  /* IN transfer completed */
    case OTGFS_GRXSTSH_PKTSTS_DTOGERR: /* Data toggle error */
    case OTGFS_GRXSTSH_PKTSTS_HALTED:  /* Channel halted */
    default:
      break;
    }

  /* Re-enable the RxFIFO non-empty interrupt */

  intmsk |= OTGFS_GINT_RXFLVL;
  stm32_putreg(STM32_OTGFS_GINTMSK, intmsk);
}

/*******************************************************************************
 * Name: stm32_gint_nptxfeisr
 *
 * Description:
 *   USB OTG FS non-periodic TxFIFO empty interrupt handler
 *
 *******************************************************************************/

static inline void stm32_gint_nptxfeisr(FAR struct stm32_usbhost_s *priv)
{
  uint32_t     regval;
  unsigned int buflen;
  unsigned int buflen32;
  unsigned int wrsize;
  unsigned int avail32;
  unsigned int chidx;

  /* Loop while there is data to be sent and where there is space available
   * in the non-periodic Tx FIFO.
   */

  for (;;)
    {
      /* Read the status from the top of the non-periodic TxFIFO */

      regval   = stm32_getreg(STM32_OTGFS_HNPTXSTS);

      /* Extract the channel number and the number of 32-bit words available in
       * the non-periodic Tx FIFO.
       */

      chidx    = (regval & OTGFS_HNPTXSTS_CHNUM_MASK) >> OTGFS_HNPTXSTS_CHNUM_SHIFT;
      avail32  = (regval & OTGFS_HNPTXSTS_NPTXFSAV_MASK) >> OTGFS_HNPTXSTS_NPTXFSAV_SHIFT;

      /* Get the number of words remaining to be sent */

      buflen   = priv->chan[chidx].buflen
      buflen32 = (buflen + 3) >> 2;

      /* Break out of the loop if either (a) there is nothing more to be
       * sent, or (2) there is insufficent space availabe in the non-periodic
       * Tx FIFO to hold the next packet.
       */

      if (buflen == 0 || avail32 <= buflen32)
        {
          return;
        }
 
      /* Get the number of bytes available in the non-periodic Tx FIFO. That
       * is the maximum write size.
       */

      wrsize = avail32 << 2;

      /* Clip the actual write size to the number of bytes actually available
       * to be sent.
       */

      if (wrsize > buflen)
        {
          /* This is the last packet to be sent.  Clip to the amount of
           * data to send in the last packet.
           */

          wrsize = buflen;
          stm32_modifyreg(STM32_OTGFS_GINTMSK, OTGFS_GINT_NPTXFE, 0);
        }

      stm32_gint_wrpacket(priv, priv->chan[chidx].buffer, chidx, wrsize);

      priv->chan[chidx].buffer += wrsize;
      priv->chan[chidx].buflen -= wrsize;
      priv->chan[chidx].xfrlen += wrsize;
    }
}

/*******************************************************************************
 * Name: stm32_gint_ptxfeisr
 *
 * Description:
 *   USB OTG FS periodic TxFIFO empty interrupt handler
 *
 *******************************************************************************/

static inline void stm32_gint_ptxfeisr(FAR struct stm32_usbhost_s *priv)
{
  uint32_t     regval;
  unsigned int buflen;
  unsigned int buflen32;
  unsigned int wrsize;
  unsigned int avail32;
  unsigned int chidx;

  /* Loop while there is data to be sent and where there is space available
   * in the periodic Tx FIFO.
   */

  for (;;)
    {
      /* Read the status from the top of the periodic TxFIFO */

      regval   = stm32_getreg(STM32_OTGFS_HPTXSTS);

      /* Extract the channel number and the number of 32-bit words available in
       * the periodic Tx FIFO.
       */

      chidx    = (regval & OTGFS_HPTXSTS_CHNUM_MASK) >> OTGFS_HPTXSTS_CHNUM_SHIFT;
      avail32  = (regval & OTGFS_HPTXSTS_PTXFSAVL_MASK) >> OTGFS_HPTXSTS_PTXFSAVL_SHIFT;

      /* Get the number of words remaining to be sent */

      buflen   = priv->chan[chidx].buflen
      buflen32 = (buflen + 3) >> 2;

      /* Break out of the loop if either (a) there is nothing more to be
       * sent, or (2) there is insufficent space availabe in the periodic
       * Tx FIFO to hold the next packet.
       */

      if (buflen == 0 || avail32 <= buflen32)
        {
          return;
        }
 
      /* Get the number of bytes available in the periodic Tx FIFO. That is
       * the maximum write size.
       */

      wrsize = avail32 << 2;

      /* Clip the actual write size to the number of bytes actually available
       * to be sent.
       */

      if (wrsize > buflen)
        {
          /* This is the last packet to be sent.  Clip to the amount of
           * data to send in the last packet.
           */

          wrsize = buflen;
          stm32_modifyreg(STM32_OTGFS_GINTMSK, OTGFS_GINT_PTXFE, 0);
        }

